<h1> Операции php</h1>


<h2> Арифметические </h2>

 
<p> +   -   *  /  **    %  </p>



<?php

$a = 33 % 22;

echo  $a;



?>


<h2> Инкремент и декремент </h2>

<?php

$b = 2;
$b++;    /// увеличение на единицу 

$c = ++$b;

echo "b = $b , c = $c";

?>


<h2> Операция со строками </h2>


<?php

$str1 = 'Hello, ';
$str2 = 'PHP! ';
$str3 = 'Я учусь на ' . '2 ' . 'курсе';

echo $str1 . $str2, '<br>' . $str3;


?>



<h2> Операции сравнения </h2>
<p> <   >   <=   >=   =   !=    ===    !==</p>


<?php

$s = 4 == '4';

$s1 = 4 === '4';

echo $s;

?>


<h2> Логические операции  </h2>
<p> Логиеское И (&& and) , Логическое ИЛИ ( || or и логичиское НЕ (!)) </p>

<?php

$p =  true && false; // false
$p1 =  true || false; // true
$p2 = 5 <= 7 && 4 == 5; // false
$p3 = !$p2; //true


?>


<h2> Операции  присваивания </h2>
<p> =    </p>

$o = $r = 5; // o и r = 5 

<p>   +=   -=   *=   /=   **=   %=  ,=  </p>


<?php

$l = 42;
$l += 10;
$string = 'Hello ';
$string .= 'world!';

echo $l ;
echo $string;


?>


<h2> Приоритет операции </h2>

<p> **  </p>

<p> ++ --  </p>

<p> !  </p>

<p> *  /  %   </p>

<p> + -  </p>

<p> <   >    <=   >=  </p>

<p> == != === !==<  </p>

<p> &&  </p>

<p> ||  </p>

<p> += -= ....  </p>


<P>Распространенная ошибка

$a < $b < $c


</p>