<h1> Операции php</h1>


<h2> Арифметические </h2>

 
<p> +   -   *  /  **    %  </p>



<?php

$a = 33 % 22;

echo  $a;



?>


<h2> Инкремент и декремент </h2>

<?php

$b = 2;
$b++;    /// увеличение на единицу 

$c = ++$b;

echo "b = $b , c = $c";

?>


<h2> Операция со строками </h2>


<?php

$str1 = 'Hello, ';
$str2 = 'PHP! ';
$str3 = 'Я учусь на ' . '2 ' . 'курсе';

echo $str1 . $str2, '<br>' . $str3;


?>



<h2> Операции сравнения </h2>
<p> <   >   <=   >=   =   !=    ===    !==</p>


<?php

$s = 4 == '4';

$s1 = 4 === '4';

echo $s;

?>


<h2> Логические операции  </h2>

