<h1>Циклический алгоритм </h1>


<h2> Цикл с предусмотрием  - while  (пока)</h2>


<?php 

$n = 0;

while ($n < 10) {

echo $n;

$n++;

}


?>


<h2> Цикл с потусловием - do ... while (делать... пока) </h2>

<?php

$n = 0;

do {

echo $n;

$n++;

}

 while ($n < 10)




?>





<h2> Цикл с параметром - for (для)</h2>

<?php 

for ($i = 0; $i < 10; $i++) {

echo $i;

}



?>




<h2> Вложенные циклы </h2>

<?php


for ($i = 0; $i < 5; $i++) {


for ($j = 0 ; $j < 10 ; $j++) {


echo 'Q';


}


echo '<br>';


}


?>



<h2> break и   continue </h2>

<p> break - Прерывает цикл и выходит за его пределы </p>
<p> continue - прерывает текущую итерацию  и переходит к проверке условия</p>



<?php




?>

