
<h2>Задача 1</h2>

<?php
$n = 5;

echo "number = $n", '<br>';

match($n) {
    0 => print("zero"),
    1 => print("one"),
    2 => print("two"),
    3 => print("three"),
    4 => print("four"),
    5 => print("five"),
    6 => print("six"),
    7 => print("seven"),
    8 => print("eight"),
    9 => print("nine"),
    default => print("Ошибка")
};
?>




<h2>Задача 2</h2>

<?php

$n = 1;





match($n) {
    1 => print("1 января — Новый год, 7 января — Рождество"), 
    2 => print("23 февраля — День защитника Отечества"),
    3 => print("8 марта — Международный женский день"),
    4 => print("Праздничных дней нет"),
    5 => print("1 мая — Праздник Весны и Труда, 9 мая — День Победы"),
    6 => print("12 июня — День России"),
    7, 8, 9, 10 => print("Праздничных дней нет"),
    11 => print("4 ноября — День народного единства"),
    12 => print("12 декабря — День Конституции"),
    default => print("Ошибка")
};
?>


<h2>Задача 3</h2>




<?php
$n = 27;
$n = abs($n) % 10;

match($n) {
    0 => print(0),
    1, 9 => print(1),
    2, 8 => print(4),
    3, 7 => print(9),
    4, 6 => print(6),
    5 => print(5)
};
?>




<h2>Задача 4</h2>


<?php
$k = 22;

$word = match(true) {
    $k % 100 >= 11 && $k % 100 <= 14 => "лет",
    $k % 10 == 1 => "год",
    $k % 10 >= 2 && $k % 10 <= 4 => "года",
    default => "лет"
};

print("Мне $k $word");
?>

















