
<h2>Задача 1</h2>


<?php

$a = 6;
$b = 5;

echo "Ввели: $a " , '<br>', '<br>';

echo "Ввели: $b ", '<br>', '<br>';

$res = $a < $b ? $a + $b : $a * $b;

echo "Ответ : $res";

?>


<h2>Задача 2</h2>



<?php

$n = 7;

echo "Ввели : $n", '<br>', '<br>';

$res = $n % 2 == 0 ? "Чётное" : "Нечётное";

echo "Оно $res";

?>


<h2>Задача 3</h2>

<?php

$sum = 1500;

echo "Ввели : $sum" ,  '<br>', '<br>';

$res = $sum > 1000 ? $sum * 0.9 : $sum * 0.95;

echo "Ответ: $res";

?>


<h2>Задача 4</h2>


<?php

$a = 3;
$b = 4;
$c = 5;

echo "a = $a",  '<br>';
echo "b = $b",  '<br>';
echo "c = $c",  '<br>',  '<br>';

$res = ($a + $b > $c && $a + $c > $b && $b + $c > $a)
    ? "Треугольник существует"
    : "Треугольник не существует";

echo $res;

?>

<h2>Задача 5</h2>



<?php

$age = 2;

echo "Ввели: $age",  '<br>',  '<br>';

$ageGroup = $age <= 1 ? "Котята" :
    ($age <= 3 ? "Молодые коты" :
    ($age <= 7 ? "Коты средних лет" :
    "Почтенные коты"));

echo "Возрастная группа = $ageGroup";

?>



<h2>Задача 6</h2>


<?php

$a = 60;
$b = 30;


echo "a = $a",  '<br>';
echo "b = $b",  '<br>',  '<br>';

$res = ($a > 0 && $b > 0 && $a + $b < 180)
    ? (($a == 90 || $b == 90 || $a + $b == 90)
        ? "Треугольник существует и он прямоугольный"
        : "Треугольник существует, но он не прямоугольный")
    : "Треугольник не существует";

echo $res;

?>